app/controllers/excerpts_controller.rb

    def index
        @excerpts = Excerpt.all
---
SELECT "excerpts".* FROM "excerpts"

    def create
        @excerpt = Excerpt.new(excerpt_params)

        if @excerpt.save
---
INSERT INTO "excerpts" ("title", "author", "chapter", "excerpts", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
        if @excerpt.update(excerpt_params)
---
UPDATE "excerpts" SET "author" = ?, "updated_at" = ? WHERE "excerpts"."id" = ?  [["author", "bartok"], ["updated_at", "2019-11-12 19:01:09.141509"], ["id", 1]]

    def set_excerpt
      @excerpt = Excerpt.find(params[:id])
---
SELECT  "excerpts".* FROM "excerpts" WHERE "excerpts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]